<a href="https://colab.research.google.com/github/Izzan-commits/Praktikum-BasisData/blob/main/Pertemuan_4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Tugas ‚Äî Skema Order Entry (Bab 4)

---

## Tugas Awal
## Berdasarkan skema order entry pada bab 3 jawablah pertayaan berikut ini :

### 1. Contoh perintah ALTER dan MODIFY dalam satu sintaks
(Mengubah kolom pada tabel yang ada dalam skema order entry, misalnya tabel products)
```sql
ALTER TABLE products
MODIFY product_price DECIMAL(10,2);
```

<br>

### 2. Contoh penggunaan DROP TABLE

(Menghapus salah satu tabel dalam skema order entry, misalnya productnotes)
```sql
DROP TABLE productnotes;
```

<br>

### 3. Contoh penerapan RENAME TABLE

(Mengubah nama tabel dalam skema order entry, misalnya customers menjadi client_data)
```pgsql
RENAME TABLE customers TO client_data;
```

<br>

---

# üìò Rangkuman ALTER TABLE dan DROP TABLE

Dokumen ini merangkum materi tentang cara mengubah struktur tabel dan menghapus tabel dalam SQL menggunakan perintah ALTER TABLE dan DROP TABLE.

<br>

---

## üîß 1. ALTER TABLE

Perintah ALTER TABLE digunakan untuk melakukan perubahan pada struktur sebuah tabel.
Ada empat jenis perubahan yang dapat dilakukan:

<br>

### 1. Mengubah Nama Field/Kolom

Mengganti nama kolom lama menjadi nama baru dengan perintah CHANGE.

Format umum:

```sql
ALTER TABLE nama_tabel
CHANGE nama_field_lama nama_field_baru Tipe_Data(Size);
```

<br>

### 2. Mengubah Tipe Data Field

Mengubah tipe data kolom, misalnya dari CHAR menjadi VARCHAR.
Perubahan ini tetap menggunakan perintah ALTER TABLE dengan sintaks yang disesuaikan.

<br>

### 3. Menambah Field/Kolom Baru

Menambahkan kolom baru ke dalam sebuah tabel menggunakan perintah ADD.

Format umum:

```sql
ALTER TABLE nama_tabel
ADD nama_field_baru Tipe_Data(Size);
```

<br>

### 4. Menghapus Field/Kolom

Menghapus kolom tertentu dari tabel menggunakan perintah DROP COLUMN.

Format umum:

```sql
ALTER TABLE nama_tabel
DROP COLUMN nama_field;
```

## üóëÔ∏è 2. DROP TABLE

Perintah DROP TABLE digunakan untuk menghapus tabel secara permanen dari database.
Semua data di dalam tabel akan hilang dan tidak dapat dikembalikan.

Format umum:

```sql
DROP TABLE nama_tabel;
```

<br>